# models/yolov5s_custom.yaml

# 수정사항 반영

# 실행 방법
# (bash)
# 학습
#python train.py --cfg models/yolov5s_custom.yaml --data custom.yaml --hyp data/hyp.custom.yaml

# ROS 배포
# roslaunch yolov5_ros yolov5_custom.launch engine_file:=yolov5s_custom.engine


# Parameters
nc: 2  # 조난자, 버티포트
depth_multiple: 0.33
width_multiple: 0.40  # 경량화 강화
anchors:
  - [12,16, 19,36, 40,28]  # 항공 이미지 최적화
  - [36,75, 76,55, 72,146]
  - [142,110, 192,243, 459,401]

# Backbone
backbone:
  [[-1, 1, Conv, [64, 6, 2, 2, None, 1, 'ReLU6']],
   [-1, 1, SPD_Conv, [128, 3]],  # SPPF → SPD-Conv 교체
   [-1, 3, C2f, [128]],          # C3 → C2f 모듈 변경
   [-1, 1, SPD_Conv, [256, 3]],
   [-1, 6, C2f, [256]],
   [-1, 1, SPD_Conv, [512, 3]],
   [-1, 9, C2f, [512]],
   [-1, 1, SPD_Conv, [1024, 3]],
   [-1, 3, C2f, [1024]],
   [-1, 1, SPD_Conv, [1024, 5]]]

# Head
head:
  [[-1, 1, AdaptiveGate, [512]],  # 멀티스케일 특징 융합
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C2f, [512, False]],
   ...]

